       01 REG-ALUNO.
              03 ID-ALUNO              PIC 9(03).
              03 NM-ALUNO              PIC X(20).
              03 TL-ALUNO.
                       05 PREFIXO      PIC 9(05).
                       05 SUFIXO       PIC 9(04).
